BrunoRicci/DataloggerDHT22/Firmware/code_esp8266_dht22/src/main.cpp
#include <Arduino.h>
//#include <string.h>
#include <time.h>

#include <ESP8266WiFi.h>
#include <ESP8266WiFiMulti.h>
#include <ESP8266HTTPClient.h>
#include <WiFiClient.h>

#include <datalogger_config.h>  //Configuration parameters.

#include <Hash.h>
#include <WebServerFiles.cpp>

#include <FS.h>           //SPIFFS libraries.
#include <rtc_memory.hpp>
#include <statemachine.hpp>


//----------------------------------------------------------------------------------------
DHT dht22_sensor_1(DHT_SENSOR_1_PIN, DHTTYPE);    //Creates DHT22 sensor "sensor" object
DHT dht22_sensor_2(DHT_SENSOR_2_PIN, DHTTYPE);    //Creates DHT22 sensor "sensor" object
DHT dht22_sensor_3(DHT_SENSOR_3_PIN, DHTTYPE);    //Creates DHT22 sensor "sensor" object
DHT dht22_sensor_4(DHT_SENSOR_4_PIN, DHTTYPE);    //Creates DHT22 sensor "sensor" object

//---------------------------------------------------------------------------------------------------------------------
//Initialization functions.
void portInit(void);
uint8_t getBatteryLevel(void);           //Get battery level percentage (0 to 100%).
void setBatteryState(uint8 state=ON);     //Connects or disconnects battery.
void setSensorPower(unsigned char state);
void wifiTurnOn(void);
void wifiTurnOff(void);
void goDeepSleep(uint64_t time);
bool isCharging(void);
bool reedSwitchIsPressed(void);

void* stringToArray(std::string origin_string);
int32_t generateMeasurementValue(unsigned char type, float value);
String formatMeasurementValue(unsigned char type, float value);  //Converts measurements into valid format
uint32_t getServerTimeUnix(void);

bool writeDataToFlash(String path, void* data, unsigned int bytes);
bool readDataFromFlash(String path, uint32_t index, void* data, unsigned int bytes);
bool archiveWrite(void* data, uint16_t bytes);
bool archiveRead(uint32_t start_index, uint32_t end_index);
uint32_t archiveGetPointer(void);
//Functions to handle 
void handleHome(void);
void handleChangeNetworkConfig(void);
void handleChangeServerConfig(void);
unsigned char runWebServer(void);
unsigned char handleFormatRam(void);
unsigned char handleFormatFlash(void);
//---------------------------------------------------------------------------------------------------------------------

ESP8266WiFiMulti WiFiMulti;             //Wifi client side handle.
ESP8266WebServer server(8080);          //Server for configuration.
StateMachine statem(STATE_WAKE);  //Create StateMachine class object. Starts at wake.
RtcMemory rtcmem;                       //Object to handle rtc memory.


void setup() {
  portInit();
  wifiTurnOff();
  Serial.begin(115200);
  
  
  SPIFFS.begin();
  
  // runWebServer();

  // handleFormatFlash();  //FOR TESTING ONLY!
  // handleFormatRam();

//////////////////////////////////////////////////////////////

/* 
  dht22_sensor_1.begin();           //Initializes objects.
  dht22_sensor_2.begin();
  dht22_sensor_3.begin();
  dht22_sensor_4.begin();

  setSensorPower(ON);
  delay(1000);
  //GET MEASUREMENTS
  for (unsigned char i = 0; i<4 ; i++){
    Serial.printf("\nTemperature_%d: %f\n", i+1, temperature_float[i] );
    Serial.printf("Humidity_%d: %f\n", i+1,humidity_float[i] );
  } 
  setSensorPower(OFF);
*/  

   /*  if(reedSwitchIsPressed()){
      digitalWrite(15,HIGH);
      if(isCharging()){
        Serial.print("\n charging...");
        rtcmem.var.measurements_pointer=74;
        rtcmem.var.current_time=1234567890;
        rtcmem.rwVariables(); //Save modified variable.
        Serial.printf("\n rtcmem variable written: %d", rtcmem.rwVariables().measurements_pointer);

        rtcmem.safeDisconnect();
      }
      else{
        Serial.print("not charging...");
        rtcmem.recoverVariables();
      }
    }
    else{
      digitalWrite(15,LOW);
    }


    Serial.printf("\n rtcmem variable read: %d", rtcmem.rwVariables().powerdown_check);
    Serial.printf("\n rtcmem variable read: %d", rtcmem.rwVariables().measurements_pointer);
    Serial.printf("\n rtcmem variable read: %d", rtcmem.rwVariables().statem_state);
    Serial.printf("\n rtcmem variable read: %d", rtcmem.rwVariables().current_time);

    rtcmem.clear();

    Serial.printf("\n rtcmem variable read: %d", rtcmem.rwVariables().powerdown_check);
    Serial.printf("\n rtcmem variable read: %d", rtcmem.rwVariables().statem_state);
    Serial.printf("\n rtcmem variable read: %d", rtcmem.rwVariables().measurements_pointer);
    Serial.printf("\n rtcmem variable read: %d", rtcmem.rwVariables().current_time);

   //Try to format flash and RAM and start again...

    if(rtcmem.checkPowerdown()){
      Serial.print("\nDevice powered off. Initializing variables from NV memory...");
      rtcmem.var.powerdown_check=0xB1;
      rtcmem.rwVariables();
      // if(rtcmem.initialize())
      //   Serial.print("\nVariables recovered successfully.");
      // else 
      //   Serial.print("\nError while recovering variables.");
    }

    // Serial.printf("\n\n time: %d", rtcmem.getCurrentTime());
    // Serial.printf("\n RAM variable read: %X", rtcmem.var.powerdown_check);
    Serial.printf("\n rtcmem variable read: %X", rtcmem.rwVariables().powerdown_check);
 */

/*   // DEBUG: Write arbitrary data to  RTC memory.
      //Get measurements...
    Measurement m;    
    m.timestamp=1234567890+millis(); //Put current timestamp
    m.id_sensor[0]=1;   
    m.id_sensor[1]=2; 
    m.id_sensor[2]=3; 
    m.id_sensor[3]=4;
    m.temperature[0]=190; 
    m.temperature[1]=195;
    m.temperature[2]=195;
    m.temperature[3]=192;
    m.humidity[0]=56; 
    m.humidity[1]=54; 
    m.humidity[2]=54; 
    m.humidity[3]=52;  */
    
  //   //Save measurements into temporary memory.
  //   if ( ! rtcmem.saveMeasurements(&m, sizeof(m))) //If data is not saved correctly in RAM...
  //   {
  //     Serial.printf(" \n -------- RTC memory full. Saving data to flash and clearing memory... --------");
  //     /* save to flash, clear RAM and then rewrite to it */
      
  //     uint8 buf[(RTC_MEMORY_MEASUREMENTS_END_BLOCK - RTC_MEMORY_MEASUREMENTS_START_BLOCK)*4];   //Temporary buffer to read measurements
  //     rtcmem.readData(RTC_MEMORY_MEASUREMENTS_START_BLOCK, &buf, (RTC_MEMORY_MEASUREMENTS_END_BLOCK - RTC_MEMORY_MEASUREMENTS_START_BLOCK)*4);

