BrunoRicci/DataloggerDHT22/Firmware/code_esp8266_dht22/src/main.cpp
  //     // writeDataToFlash(MEASUREMENTS_FILE_NAME, buf, sizeof(buf)); //Save measurements to flash.
  //     archiveWrite(buf, sizeof(buf));
  //     rtcmem.clearMeasurements();   //Clears rtc memory.

  //     m.timestamp=millis();   //Put actual time for the moment the pending to store measurement is stored.
  //     rtcmem.saveMeasurements(&m, sizeof(m));   //Saves current measurement.
  
  //   }

  
  
  

}


void loop() {
  server.handleClient(); //Handling of incoming requests

  //Make method to detect if power was disconnected (to automatically call method
  // recoverVariables() and initialize rtc memory properly.)
  
  if(statem.getState() == STATE_WAKE){
    
    if(statem.stateInit()){
       Serial.printf("\n --- State: %d ---", statem.getState());
      
      //Checks if device has lost power supply.
      Serial.print("\n read powerdown check...");
      Serial.printf("\n powerdown_check: %d", rtcmem.rwVariables().powerdown_check);
      if(rtcmem.checkPowerdown()){
          Serial.print("\nDevice has lost power supply");
          if(rtcmem.initialize()){  //Recovers variables
            Serial.print("\nRTC memory recovered correctly.");
            Serial.print("\n intializing...");
            Serial.printf("\n powerdown_check: %d", rtcmem.rwVariables().powerdown_check);

          }
          else
          {
            Serial.print("\n RTC memory recovery failed.");
          }
          /* Problem: Data is actually saved in RTC memory right after boot, but in method
          rwVariables(), it is overwritten, as data in RAM and RTC will be different after
          the power up, because RAM variables will start in any value.
          To avoid this, "initialize" method is used, which will put valid values into 
          the registers

          SOLUTION:
            Don't read data with rwVariables method as it also writes it when it's inconsistant.
            In the first state (wake) or in the RtcMemory constructor, load the RAM variables (var)
            with values stored in RTC memory with a read-only method.
 */
      }
      else{
          Serial.print("\nDevice has not lost power supply");
      }

      if(digitalRead(REED_SWITCH_PIN)){ //Si el reed switch está activado...
        digitalWrite(15,HIGH);     //DEBUG
        rtcmem.safeDisconnect();  //Saves rtc variables to non-volatile.
        Serial.print("\n   RTC memory content saved to flash.");
       //Get last machine state stored into rtc memory.
      }
    }
   
    // statem.setState(rtcmem.rwVariables().statem_state); 
     
  } 
  else if (statem.getState() == STATE_GET_MEASUREMENTS){
      
    if(statem.stateInit()){
      Serial.printf("\n --- State: %d ---", statem.getState());
    }
    
  }
  else if (statem.getState() == STATE_SAVE_MEASUREMENTS){
    if(statem.stateInit()){
      Serial.printf("\n --- State: %d ---", statem.getState());
    }
  }
  else if (statem.getState() == STATE_TRANSMISSION){
    
  }
  else if (statem.getState() == STATE_CONFIGURATION){
   
  }
  else if (statem.getState() == STATE_SEALED){
    
  }


  goDeepSleep(15e6-millis());




  //Waits for WiFi connection
/*   if ((WiFiMulti.run() == WL_CONNECTED)) {
    Serial.printf("WiFi Connected!");
    
    WiFiClient client;
    HTTPClient http;
  
    Serial.print("[HTTP] begin...\n");
    if (http.begin(client, "http://192.168.0.172:8080/sendmeasurements")) {  // HTTP
      String request;

      
      //Send POST request
      Serial.print("[HTTP] POST...:\n");
      Serial.print(request);
      int httpCode = http.POST( request );
      //int httpCode = http.GET();

      // httpCode will be negative on error
      if (httpCode > 0) {
        // HTTP header has been send and Server response header has been handled
        Serial.printf("[HTTP] POST... code: %d\n", httpCode);
        
        // file found at server
        if (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY) {
          String payload = http.getString();
          Serial.println(payload);
        }

        goDeepSleep(60e6);  //Deep sleep for low power consumption.

      } else {
        Serial.printf("[HTTP] GET failed, error: %s\n", http.errorToString(httpCode).c_str());
        goDeepSleep(60e6);
      }
      http.end();
    } 
    else {
      Serial.printf("[HTTP] Unable to connect\n");
      goDeepSleep(60e6);  //Deep sleep for low power consumption.
    }
  } 
*/

  
}

void portInit(void){
  pinMode(PWR_SENSORS_PIN, OUTPUT);   //GPIO12 as output
  pinMode(PWR_CONTROL_PIN, OUTPUT);
  pinMode(14, INPUT);
  pinMode(15, OUTPUT);
  pinMode(13, OUTPUT);
  pinMode(12, OUTPUT);
  digitalWrite(15,LOW);
  digitalWrite(13,HIGH);
  digitalWrite(12,HIGH);
  setSensorPower(OFF);          //Sensors start turned off.
}

void setBatteryState(uint8 state){
  if (state == ON)
  {
    // digitalWrite(PWR_CONTROL_PIN, HIGH);
    pinMode(PWR_CONTROL_PIN, INPUT);
  }
  else if (state == OFF)
  {
    pinMode(PWR_CONTROL_PIN, OUTPUT);
    digitalWrite(PWR_CONTROL_PIN, LOW);
  }  
}

uint8_t getBatteryLevel(void){
  uint16_t voltage = (uint16_t)((analogRead(BATTERY_SENSE_PIN))*(ADC_VOLTAGE_MV/1023));
  uint16_t real_voltage = (uint16_t)((float)(voltage*VBAT_VADC_RATIO));   //Actual voltage before divider.
  // Serial.printf("\nReal voltage = %dmV" ,real_voltage);
  uint8_t percentage = ( ((real_voltage - BATTERY_MIN_VOLTAGE)*100) / (BATTERY_MAX_VOLTAGE-BATTERY_MIN_VOLTAGE) );
  // Serial.printf("\nPercentage: %d" ,percentage);

  return percentage;  //Returns battery percentage.
}

bool isCharging(void){
  //Returns true if the device is being charged.
  setSensorPower(OFF);    //Sensors must be powered off in order to detect the charger properly.
  if ( digitalRead(CHARGER_DETECT_PIN) )  //
    return true;
  else
    return false;  
}

bool reedSwitchIsPressed(void){
  //Returns true if reed switch is pressed (when GPIO associated is in logic 1).
  if(digitalRead(REED_SWITCH_PIN))  return true;
  else  return false;
}

bool writeDataToFlash(String path, void* data, unsigned int bytes) { // send the right file to the client (if it exists)
  //todo: validate data and bytes parameters. ALso chech if path exists to avoid creating multiple files unnecessarily.
  
  Serial.printf("\n\n Data to write to flash:\n  buf=");
  for (uint16 i = 0; i < bytes; i++)
  {
    Serial.printf("%X ", ((const char*)data)[i]);
  }

